{
    "Blacksmith": [
        "The weapons made in the <SHOP> are known all throughout <TOWN> for their durability. The secret? <OWNER> doesn't uses regular metals. Instead, the weapons are made with an alloy that contains the remains of a Magma Mephit. This prevents the weapons from breaking, but also appears to prevent corrosion.",
        "Although the tools made in the <SHOP> are made very well, it is known that not many purchase anything that isn't overpriced. The owner of the shop, <OWNER>, is known for being a great salesman, and regularly manages to sell items for a higher price than that they are worth.",
        "The <SHOP> is a new store that had opened just recently. When <OWNER> moved to <TOWN> only a handful of days ago, they decided it would be best to earn their money by selling weapons and tools.",
        "The <SHOP> is known for being involved with business from the underground. You'll often spot shady customers buying goods for suspicious reasons here. The owner of the shop, <OWNER>, does not feel the need to have conversations with their customers either. You simply get what you want, and then you leave the store.",
        "The citizens of <TOWN> tell rumors about how lots of people had strange accidents when they worked with tools from the <SHOP>.",
        "This small establishment seems to have passed through some rough times. The owner will make whatever they can to make you come back!",
        "<SHOP> is well run and regularly shopped at by the denizens of <TOWN>. <OWNER> adds lots of small decorations like spikes and rivets to the armor that many of the townspeople believe enhances the quality, but to a trained eye these are purely aesthetic and serve no protective function."
    ],
    "Salesman": [
        "The <SHOP> is one of <TOWN>'s favourite shops! Their products aren't always the best, but you'll always get your money's worth.",
        "Not many who live in <TOWN> would visit the <SHOP> for their pleasure. The owner of the shop is known for acting in a strange manner that people do not trust.",
        "Careful when you choose to enter this store: the owner seems to prefer to deal with people of their same race. Other races will get a slightly worse deal, or even get scammed!",
        "The <SHOP> is a very calm store with few customers. Secretly, it is a hiding place for wanted criminals. <OWNER> keeps all the wanted criminals in a hidden basement and uses all the earned money to buy food for the criminals. Not many people in <TOWN> know about <OWNER>'s secret.\nAll items that <SHOP> sells are overpriced and <OWNER> wil desperately sell as much as possible for as much gold as possible, in order to be able to afford for all the food.",
        "In the basement of the <SHOP>, there is an entrance to <TOWN>'s sewers that hardly anyone knows about. The owner, <OWNER>, uses this entrance to feed the creatures that live below, making the creatures so big and ferocious that the sewers have become a dangerous place to enter.",
        "<SHOP> has a great selection of all sorts of goods, but the owner <OWNER> takes pride in the selection of fresh artisan cheeses."
    ],
    "Magic merchant": [
        "Besides being a shop, the <SHOP> is also known for the enthusiastic owner, <OWNER>, who entertains children on the street when no-one is looking for any goods to buy in their shop. The shop is filled with magical items and small trinkets that aren't always as useful, but are fun to play around with.",
        "The <SHOP> is a high-standard jewelry shop that excels in magical jewelry. While their prices are often immensely high, people come from far and wide to visit the store and to have a look at <OWNER>'s magical jewels.",
        "<SHOP> looks messy, to say the least. The owner is always working, reading, mumbling to themselves, pacing around the room dodging the piles of stuff they have. They won't realize they are being talked to. In fact, they will tell everybody off who dares interrupt their work. People in <TOWN> wonder how this shop owner actually makes a living...",
        "<OWNER>, the owner of <SHOP>, secretly finds most of the magic items by walking through forests and caves with their dog, who can smell magic. Unfortunately, the dog also smells mimics, and a third of the items sold are therefore baby mimics, biding their time."
    ]
}